# Data erase
## Zhanchao Yang

In [2]:
import pandas as pd
import geopandas as gpd

In [10]:
energy_df=pd.read_csv("C:\data\Energy Dashboard.csv")

In [11]:
energy_df.head(n=5)

            START_TIME             END_TIME BUILDING_ID TYPE    VALUE
0  2022-11-01 00:10:05  2022-11-01 01:10:05          S5    H  104.967
1  2022-11-01 00:10:05  2022-11-01 01:10:05          SL    E   45.473
2  2022-11-01 00:10:05  2022-11-01 01:10:05          SE    E   31.745
3  2022-11-01 00:10:05  2022-11-01 01:10:05          SE    W  520.000
4  2022-11-01 00:10:05  2022-11-01 01:10:05          SM    E   15.613

In [12]:
columns=['START_TIME','END_TIME','BUILDING_ID','VALUE']
energy_df=energy_df[columns]

In [14]:
energy_df

                 START_TIME             END_TIME BUILDING_ID    VALUE
0       2022-11-01 00:10:05  2022-11-01 01:10:05          S5  104.967
1       2022-11-01 00:10:05  2022-11-01 01:10:05          SL   45.473
2       2022-11-01 00:10:05  2022-11-01 01:10:05          SE   31.745
3       2022-11-01 00:10:05  2022-11-01 01:10:05          SE  520.000
4       2022-11-01 00:10:05  2022-11-01 01:10:05          SM   15.613
...                     ...                  ...         ...      ...
208076  2022-12-22 22:10:10  2022-12-22 23:10:10          MO      NaN
208077  2022-12-22 22:10:10  2022-12-22 23:10:10          RC   18.472
208078  2022-12-22 22:10:10  2022-12-22 23:10:10          RC      NaN
208079  2022-12-22 22:10:10  2022-12-22 23:10:10         NaN    8.010
208080  2022-12-22 22:10:10  2022-12-22 23:10:10          C4  110.715

[208081 rows x 4 columns]

In [15]:
energy_df.columns=["start","end","building","value"]

In [19]:
energy_df

                      start                  end building    value
0       2022-11-01 00:10:05  2022-11-01 01:10:05       S5  104.967
1       2022-11-01 00:10:05  2022-11-01 01:10:05       SL   45.473
2       2022-11-01 00:10:05  2022-11-01 01:10:05       SE   31.745
3       2022-11-01 00:10:05  2022-11-01 01:10:05       SE  520.000
4       2022-11-01 00:10:05  2022-11-01 01:10:05       SM   15.613
...                     ...                  ...      ...      ...
208076  2022-12-22 22:10:10  2022-12-22 23:10:10       MO      NaN
208077  2022-12-22 22:10:10  2022-12-22 23:10:10       RC   18.472
208078  2022-12-22 22:10:10  2022-12-22 23:10:10       RC      NaN
208079  2022-12-22 22:10:10  2022-12-22 23:10:10      NaN    8.010
208080  2022-12-22 22:10:10  2022-12-22 23:10:10       C4  110.715

[208081 rows x 4 columns]

In [20]:
type(energy_df)

pandas.core.frame.DataFrame

In [21]:
energy_df.head(n=5)

                 start                  end building    value
0  2022-11-01 00:10:05  2022-11-01 01:10:05       S5  104.967
1  2022-11-01 00:10:05  2022-11-01 01:10:05       SL   45.473
2  2022-11-01 00:10:05  2022-11-01 01:10:05       SE   31.745
3  2022-11-01 00:10:05  2022-11-01 01:10:05       SE  520.000
4  2022-11-01 00:10:05  2022-11-01 01:10:05       SM   15.613

In [22]:
from matplotlib import pyplot as plt